Revit 2027 API
ParameterTypeId.DoorOperationType Property
 "Operation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DoorOperationType { get; }
Public Shared ReadOnly Property DoorOperationType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DoorOperationType {
	ForgeTypeId^ get ();
}
static member DoorOperationType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace